# Практическая работа №2. Объектно-ориентированное программирование в Java. Классы в Java

**Цель:**
Изучить основные концепции объектно-ориентированного программирования, понятие класса и научиться создавать классы.

---

## Теоретические сведения

### Модификаторы доступа в Java

В Java существуют следующие модификаторы доступа:

- **private**: данные класса доступны только внутри класса;
- **protected**: данные класса доступны внутри пакета и в наследниках;
- **public**: данные класса доступны всем.

---

### Пример: Класс Circle

Каждая окружность имеет несколько параметров:

- Координаты по оси **x**;
- Координаты по оси **y**;
- Радиус **r**;
- Цвет **colour**.


#### Объявление переменных класса:

```java
private double x;
private double y;
private double r;
private String colour;
```


---

#### Геттеры и сеттеры

Добавление стандартных методов **get** и **set** (“геттер” и “сеттер”):

```java
public double getX() { return x; }
public void setX(double x) { this.x = x; }

public double getY() { return y; }
public void setY(double y) { this.y = y; }

public double getR() { return r; }
public void setR(double r) { this.r = r; }

public String getColour() { return colour; }
public void setColour(String colour) { this.colour = colour; }
```

**return** используется для возврата значения (геттеры), **this.** ссылается на данные текущего объекта (сеттеры).

---

#### Конструктор

```java
public Circle(double x, double y, double r, String colour) {
    this.x = x;
    this.y = y;
    this.r = r;
    this.colour = colour;
}
```


---

#### Метод toString

```java
@Override
public String toString() {
    return "Circle{" +
        "x=" + x +
        ", y=" + y +
        ", r=" + r +
        ", colour='" + colour + '\'' +
    '}';
}
```


---

#### Метод расчёта длины окружности

```java
public double getLength() {
    double c;
    c = 2 * Math.PI * r;
    return c;
}
```


---

### Класс Tester (Main)

Добавление необходимых библиотек:

```java
import java.lang.*;
import java.util.Scanner;
```

Создание метода **main(String[] args)** и переменной **r**:

```java
public class Tester {
    public static void main(String[] args) {
        double r;
        Circle k1 = new Circle(3.1, 4.1, 5.1, "red");
        System.out.println("Длина окружности = " + k1.getLength() + "см\n");

        Scanner source = new Scanner(System.in);
        System.out.println("Введите радиус ");
        r = source.nextDouble();

        k1.setR(r);
        System.out.println("\nДлина окружности = " + k1.getLength() + "см");
    }
}
```


---

## Задания на практическую работу №2

**1.** По диаграмме класса UML, описывающей сущность **Автор**, написать программу из двух классов **Author** и **TestAuthor**. Класс **Author** должен содержать реализацию методов согласно диаграмме.

---

**2.** По UML-диаграмме класса **Ball**, реализовать классы **Ball** (мяч) и **TestBall** (тестирование). Класс **Ball** моделирует движущийся мяч.

---

**3.** Создать класс **Point**, описывающий точку на плоскости.
Создать класс **Circle** с полем — центр (объект Point), другими параметрами окружности.
Создать класс **Tester**, в котором хранится массив объектов **Circle** и поле для количества элементов в массиве.

---

**4.** Разработать класс **Shop**, реализовать методы добавления, удаления и поиска компьютеров в магазине. Протестировать работу.
Данные о компьютерах вводятся пользователем с клавиатуры (использовать интерфейс).

---

**5.** Класс **Dog** (Собака): поля – кличка и возраст.

- Конструктор для инициализации данных.
- Геттеры и сеттеры для имени и возраста.
- Метод для перевода возраста в “человеческий” (7 × возраст собаки).
- Метод **toString**.
- Класс **ПитомникСобак** (тестер, массив собак, добавление объектов).

---

**6.** Класс **Circle** с методами вычисления площади и длины, способом сравнения двух окружностей.
Класс **CircleTest** тестирует работу.

---

**7.** Класс **Book** (свойства: автор, название, год и пр.), методы геттеры/сеттеры.
Класс **BookTest** (тестирование), класс **КнижнаяПолка** (массив книг, количество, методы поиска самой ранней и поздней книги, метод сортировки по годам).

---

**8.** Программа для замены элементов одномерного массива **String** в обратном порядке без дополнительного массива.

---

**9.** Программа **Poker.java**: имитация раздачи карт для **n** игроков (по 5 карт), карты перетасованы.
Вывести 5 карт каждого игрока, разделяя пустой строкой.

---

**10.** Программа **HowMany.java** определяет количество введённых с консоли слов.

---

